double x {0}, y {0};

x = - 4; // x 赋值为 负数
if (x < 0) // 条件
    y = x *7; // 当 if 条件满足，则执行此赋值语句
else
    y = x  + 10; // 当 if 条件为假，则执行此赋值语句

y // 符合预期 x * 7

x = 5; // x 赋值为 非负数
if (x < 0) // 不满足条件
    y = x *7;
else  // 满足条件
    y = x  + 10; // 当 if 条件为假，则执行此赋值语句

y // 符合预期 x + 10

x = 0;
if (x < 0)
    y = x *7;
else if (x == 0)
    y = x + 100;
else
    y = x  + 10; // 当 if 条件为假，则执行此赋值语句

y // 符合预期 x + 100

int S {0}; // 初始化 S 用于存储求和的结果
int x {0}; // 初始化 x 为 0
while (x <= 10) {
    S += x;
    ++x;
}

S // 符合预期

int S {0}; // 初始化 S 用于存储求和的结果
for (int x {0}; x <= 10; ++x)
    S += x

S // 符合预期


